# iloc

Documentação: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html

O iloc é utlizado para selecionar linhas e colunas de um DataFrame por um índice inteiro.

In [18]:
import pandas as pd
import numpy as np

## Exemplo 1)

In [19]:
mydict = {'a': [1, 100, 1000],
          'b': [2, 200, 2000],
          'c': [3, 300, 3000],
          'd': [4, 400, 4000]}

df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [20]:
# primeira linha do dataframe, juntamente com o nome da coluna
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [21]:
# selecionando as linhas de índice 0 e 1
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [22]:
# selecionandoas linhas de índice 1 e 2
df.iloc[[1,2]]

      a     b     c     d
1   100   200   300   400
2  1000  2000  3000  4000

In [23]:
# selecionando as linhas de índice 0 e 2
df.iloc[[0,2]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [24]:
# slice indicando que queremos as primeiras duas linhas do dataframe
df.iloc[:2]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

## Exercício 1) Selecionar uma linha específica

Dado o DataFrame df1 abaixo, use iloc para selecionar a segunda linha (índice 1)

In [25]:
df1 = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60]})
df1

    A   B
0  10  40
1  20  50
2  30  60

In [26]:
# selecionando a segunda linha

df1.iloc[1]

A    20
B    50
Name: 1, dtype: int64

## Exercício 2) Selecionar um intervalo de linhas

Com o mesmo DataFrame df1, use iloc para selecionar as duas primeiras linhas.

In [27]:
df1.iloc[:2]

    A   B
0  10  40
1  20  50

## Exercício 3) Selecionar uma coluna específica

Usando o DataFrame df1, use iloc para selecionar apenas a coluna 'B'.

In [28]:
df1.iloc[:, 1]

0    40
1    50
2    60
Name: B, dtype: int64

# Exercício 4) Selecionar linhas e colunas específicas

Usando df1, selecione as duas primeiras linhas e a segunda coluna.

In [61]:
df1

    A   B
0  10  40
1  20  50
2  30  60

In [62]:
df1.iloc[0:2, 1]

0    40
1    50
Name: B, dtype: int64

# Exercício 5) Selecionar múltiplas linhas e colunas específicas

No DataFrame df1, use iloc para selecionar a primeira e a terceira linha e ambas as colunas.

In [31]:
df1

    A   B
0  10  40
1  20  50
2  30  60

In [32]:
df1.iloc[[0,2]]

    A   B
0  10  40
2  30  60

# Exercício 6) Substituir valores em um intervalo

Crie um DataFrame df2 com números aleatórios. Usando iloc, substitua os valores nas duas primeiras linhas e duas primeiras colunas por 0.

In [33]:

np.random.seed(42)
df2 = pd.DataFrame({'coluna1': np.random.randint(100, size=4),
       'coluna2': np.random.randint(100, size=4),
       'coluna3': np.random.randint(100, size=4),
       'coluna4': np.random.randint(100, size=4)})

df2

   coluna1  coluna2  coluna3  coluna4
0       51       60       74       23
1       92       20       74        2
2       14       82       87       21
3       71       86       99       52

In [34]:
# substituindo os valores nas duas primeiras linhas e colunas por zero
df2.iloc[0:2,0:2] = 0
df2

   coluna1  coluna2  coluna3  coluna4
0        0        0       74       23
1        0        0       74        2
2       14       82       87       21
3       71       86       99       52

# Exercício 7) Selecionar usando passo

Usando um DataFrame com 10 linhas, selecione todas as linhas ímpares (1, 3, 5, ...) e todas as colunas usando iloc.

In [35]:
df3 = pd.DataFrame({'coluna1': np.random.randint(100, size=10),
       'coluna2': np.random.randint(100, size=10),
       'coluna3': np.random.randint(100, size=10),
       'coluna4': np.random.randint(100, size=10),
       'coluna5': np.random.randint(100, size=10),
       'coluna6': np.random.randint(100, size=10),
       'coluna7': np.random.randint(100, size=10),
       'coluna8': np.random.randint(100, size=10),
       'coluna9': np.random.randint(100, size=10),
       'coluna10': np.random.randint(100, size=10)})

df3

,coluna1,coluna2,coluna3,coluna4,coluna5,coluna6,coluna7,coluna8,coluna9,coluna10
0,1,57,14,6,89,34,53,13,79,44
1,87,21,61,20,52,77,92,94,81,64
2,29,88,61,72,1,80,62,47,52,88
3,37,48,46,38,83,35,17,14,23,70
4,1,90,61,17,91,49,89,71,25,8
5,63,58,50,3,59,3,43,77,88,87
6,59,41,54,88,70,1,33,86,59,0
7,20,91,63,59,43,5,73,61,40,7
8,32,59,2,13,7,53,61,39,28,87
9,75,79,50,8,46,3,99,84,14,62

In [36]:
df3.iloc[[1,3,5,7,9]]

,coluna1,coluna2,coluna3,coluna4,coluna5,coluna6,coluna7,coluna8,coluna9,coluna10
1,87,21,61,20,52,77,92,94,81,64
3,37,48,46,38,83,35,17,14,23,70
5,63,58,50,3,59,3,43,77,88,87
7,20,91,63,59,43,5,73,61,40,7
9,75,79,50,8,46,3,99,84,14,62

# Exercício 8) Selecionar com base em uma condição

Dado o DataFrame df3 com valores aleatórios, use iloc para selecionar todas as linhas onde o valor da primeira coluna é maior que 50.

In [37]:
condicao = df3['coluna1'] > 50

resultado = df3.iloc[condicao.values]
resultado

,coluna1,coluna2,coluna3,coluna4,coluna5,coluna6,coluna7,coluna8,coluna9,coluna10
1,87,21,61,20,52,77,92,94,81,64
5,63,58,50,3,59,3,43,77,88,87
6,59,41,54,88,70,1,33,86,59,0
9,75,79,50,8,46,3,99,84,14,62

# Exercício 9) Modificar valores com base em uma condição

Usando o DataFrame df3, use iloc para multiplicar por 2 todos os valores nas colunas 3 e 4 onde os valores da coluna 1 são menores que 30.

In [38]:
condicao2 = df3['coluna1'] < 30

df3.iloc[condicao2.values].iloc[:,[2,3]]*2

   coluna3  coluna4
0       28       12
2      122      144
4      122       34
7      126      118

# Revisão dia 06/09/2024

Link exercícios: https://chatgpt.com/c/aa5a17b1-e7f7-4140-b2ed-4ed737d14b13

## Exercício 1) Acessar um valor específico

Crie um DataFrame simples com 3 linhas e 3 colunas. Use iloc para acessar o valor da segunda linha e terceira coluna.

In [39]:
# criando dataframe
import pandas as pd

df = pd.DataFrame({'Nome': ['Bia','Beatriz','Bianca'],
      'Hobby': ['Tocar violão', 'Andar de skate', 'Jogar vôlei'],
      'Defeito': ['Amar demais', 'Braba', 'Ansiosa']})

df.head()

      Nome           Hobby      Defeito
0      Bia    Tocar violão  Amar demais
1  Beatriz  Andar de skate        Braba
2   Bianca     Jogar vôlei      Ansiosa

In [40]:
# acessando valor da segunda linha e terceira coluna
df.iloc[(1,2)]

'Braba'

## Exercício 2) Selecionar uma coluna inteira

Dado o DataFrame a seguir, use iloc para selecionar e exibir a segunda coluna inteira.

In [41]:
data = {'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]}
df = pd.DataFrame(data)
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [42]:
# selecionando a segunda coluna inteira
df.iloc[:,1]

0    40
1    50
2    60
Name: B, dtype: int64

## Exercício 3) Selecionar um intervalo de linhas e colunas

Crie um DataFrame com 6 linhas e 4 colunas. Use iloc para selecionar as primeiras 3 linhas e as duas primeiras colunas.

In [55]:
import numpy as np

In [54]:
np.random.seed(42)
df = pd.DataFrame({'Produto1': np.random.randint(100, size=6),
      'Produto2': np.random.randint(100, size=6),
      'Produto3': np.random.randint(100, size=6),
      'Produto4': np.random.randint(100, size=6)})

df

   Produto1  Produto2  Produto3  Produto4
0        51        82        23        29
1        92        86         2        37
2        14        74        21         1
3        71        74        52        63
4        60        87         1        59
5        20        99        87        20

In [65]:
# selecionando as 3 primeiras linhas e duas primeiras colunas
df.iloc[0:3,0:2]

   Produto1  Produto2
0        51        82
1        92        86
2        14        74

# Exercício 4) Modificar valores usando iloc

Dado o DataFrame a seguir, use iloc para modificar o valor da célula localizada na quarta linha e segunda coluna para 99.

In [67]:
data = {'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]}
df = pd.DataFrame(data)
df

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [73]:
df.iloc[(3,1)] = 99
df

   A   B
0  1   6
1  2   7
2  3   8
3  4  99
4  5  10

# Exercício 5) Selecionar linhas com múltiplas condições

Dado o DataFrame a seguir, use iloc para selecionar as últimas 3 linhas e as duas últimas colunas.

In [74]:
data = {'A': [1, 2, 3, 4, 5, 6], 'B': [10, 20, 30, 40, 50, 60], 'C': [100, 200, 300, 400, 500, 600]}
df = pd.DataFrame(data)
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
5  6  60  600